config/emacs/config.org
#+TITLE: DT's GNU Emacs Config
#+AUTHOR: Derek Taylor (DT)
#+DESCRIPTION: DT's personal Emacs config.
#+STARTUP: showeverything
#+OPTIONS: toc:2

* TABLE OF CONTENTS :toc:
- [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#adding-the-scripts-directory-to-path][Adding the scripts directory to path]]
  - [[#sourcing-the-scripts][Sourcing the scripts]]
- [[#all-the-icons][ALL THE ICONS]]
- [[#cc-indentation-style][C/C++ INDENTATION STYLE]]
- [[#backup][BACKUP]]
- [[#company][COMPANY]]
- [[#dashboard][DASHBOARD]]
- [[#diminish][DIMINISH]]
- [[#elfeed][ELFEED]]
- [[#evil][EVIL]]
- [[#flycheck][FLYCHECK]]
- [[#fonts][FONTS]]
  - [[#setting-the-font-face][Setting the Font Face]]
- [[#zooming-inout][Zooming In/Out]]
- [[#general-keybindings][GENERAL KEYBINDINGS]]
- [[#git-programs][GIT PROGRAMS]]
  - [[#git-time-machine][Git Time Machine]]
  - [[#magit][Magit]]
- [[#highlight-todo][HIGHLIGHT TODO]]
- [[#ivy-counsel][IVY (COUNSEL)]]
- [[#language-support][LANGUAGE SUPPORT]]
- [[#mass-commenting][MASS COMMENTING]]
- [[#modeline][MODELINE]]
- [[#neotree][NEOTREE]]
- [[#org-mode][ORG MODE]]
  - [[#enabling-table-of-contents][Enabling Table of Contents]]
  - [[#enabling-org-bullets][Enabling Org Bullets]]
  - [[#diminish-org-indent-mode][Diminish Org Indent Mode]]
  - [[#org-level-headers][Org Level Headers]]
  - [[#source-code-block-tag-expansion][Source Code Block Tag Expansion]]
- [[#perspective][PERSPECTIVE]]
- [[#projectile][PROJECTILE]]
- [[#rainbow-delimiters][RAINBOW DELIMITERS]]
- [[#rainbow-mode][RAINBOW MODE]]
- [[#sane-defaults][SANE DEFAULTS]]
- [[#shells-and-terminals][SHELLS AND TERMINALS]]
  - [[#eshell][Eshell]]
- [[#vterm][Vterm]]
- [[#vterm-toggle][Vterm-Toggle]]
- [[#sudo-edit][SUDO EDIT]]
- [[#theme][THEME]]
- [[#tldr][TLDR]]
- [[#transparency][TRANSPARENCY]]
- [[#tuareg-orcaml-formatting][TUAREG ORCAML FORMATTING]]
- [[#which-key][WHICH-KEY]]

* IMPORTANT PROGRAMS TO LOAD FIRST
To keep this =config.org= a reasonable length, I have moved a lot of code to individual scripts that will be sourced by this config.  These scripts are found in "~/.config/emacs/scripts" and do not contain any code that most people are likely to need to edit.

** Adding the scripts directory to path
#+begin_src emacs-lisp
(defconst dt/emacs-dir user-emacs-directory
  "Root of this Emacs config.")

(defun dt/in-emacs-dir (rel)
  "Return REL path inside `dt/emacs-dir`."
  (expand-file-name rel dt/emacs-dir))

(add-to-list 'load-path (dt/in-emacs-dir "scripts/"))
#+end_src

** Sourcing the scripts
#+begin_src emacs-lisp
(require 'elpaca-setup)  ;; The Elpaca Package Manager
(require 'buffer-move)   ;; Buffer-move for better window management
(require 'app-launchers) ;; Use emacs as a run launcher like dmenu (experimental)
#+end_src

* ALL THE ICONS
This is an icon set that can be used with dashboard, dired, ibuffer and other Emacs programs.
  
#+begin_src emacs-lisp
(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))

(use-package all-the-icons-dired
  :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))
#+end_src

* C/C++ INDENTATION STYLE
Indentation for C/C++ copied from Dr. Liow's init.el. Makes it so
{} line up with for, while, etc. Does few similar other things.

#+begin_src emacs-lisp
;; -------------------------
;; C/C++ indentation: force 4 spaces everywhere
;; Works for BOTH:
;;   - cc-mode:     c-mode / c++-mode
;;   - tree-sitter: c-ts-mode / c++-ts-mode
;; -------------------------

;; 1) If your Emacs/distro is auto-remapping c-mode -> c-ts-mode, that's fine.
;;    We'll configure BOTH systems so indentation is still 4 either way.

;; ---------- CC MODE (c-mode / c++-mode) ----------
(with-eval-after-load 'cc-mode

  ;; Smarter brace newline behavior for enum and initializer-list braces
  (defun cole/c-brace-open (syntax pos)
    (save-excursion
      (let ((start (c-point 'bol))
            langelem)
        (if (and (eq syntax 'brace-list-open)
                 (setq langelem (assq 'brace-list-open c-syntactic-context))
                 (progn
                   (goto-char (c-langelem-pos langelem))
                   (if (eq (char-after) ?{)
                       (c-safe (c-forward-sexp -1)))
                   (looking-at "\\<enum\\>[^_]")))
            '(before after)
          (if (< (point) start)
              '(after))))))

  (defun cole/c-brace-close (syntax pos)
    (save-excursion
      (goto-char pos)
      (if (> (c-point 'bol)
             (progn (up-list -1) (point)))
          '(before))))

  ;; Doxygen font-lock (ported)
  (defconst cole/doxygen-font-lock-doc-comments
    `(("\\s-\\([\\@].*?\\)\\s-"
       1 font-lock-constant-face prepend nil)
      ("\\[in\\]\\|\\[out\\]\\|\\[in,out\\]"
       0 font-lock-constant-face prepend nil)
      ("\\<\\(?:[a-zA-Z_][a-zA-Z0-9_]*::\\)*[a-zA-Z_][a-zA-Z0-9_]*()"
       0 font-lock-constant-face prepend nil)))

  (defconst cole/doxygen-font-lock-keywords
    `((,(lambda (limit)
          (c-font-lock-doc-comments "/\\*[*!]<?" limit
            cole/doxygen-font-lock-doc-comments)
          (c-font-lock-doc-comments "//[/!]<?" limit
            cole/doxygen-font-lock-doc-comments)))))

  ;; Define the style
  (c-add-style
   "aek"
   '((c-doc-comment-style . doxygen)
     (c-basic-offset . 4)
     (c-comment-only-line-offset . 0)
     (c-hanging-braces-alist . ((substatement-open before after)
                                (brace-list-open . cole/c-brace-open)
                                (brace-list-close . cole/c-brace-close)
                                (class-close before)))
     (c-hanging-semi&comma-criteria . (c-semi&comma-no-newlines-before-nonblanks
                                       c-semi&comma-inside-parenlist))
     (c-offsets-alist . ((topmost-intro     . 0)
                         (substatement      . +)
                         (substatement-open . 0)   ;; brace aligns with for/if/while
                         (case-label        . +)
                         (access-label      . -)
                         (inclass           . +)
                         (inline-open       . 0)
                         (brace-list-open   . 0)
                         (brace-list-close  . 0)))))

  ;; Make it the default for CC Mode
  (add-to-list 'c-default-style '(c-mode . "aek"))
  (add-to-list 'c-default-style '(c++-mode . "aek"))

  ;; Apply style + force 4 + doxygen highlighting
  (defun cole/c-mode-common-setup ()
    "Apply my CC Mode defaults."
    (c-set-style "aek")
    ;; FORCE 4 even if something else tries to override it
    (setq-local c-basic-offset 4)
    (setq-local tab-width 4)
    (setq-local indent-tabs-mode nil)
    (c-toggle-auto-hungry-state -1)
    (font-lock-add-keywords nil cole/doxygen-font-lock-keywords t))

  (add-hook 'c-mode-common-hook #'cole/c-mode-common-setup))

;; ---------- TREE-SITTER (c-ts-mode / c++-ts-mode) ----------
;; These variables are different from c-basic-offset; you must set them separately.
(with-eval-after-load 'c-ts-mode
  (setq c-ts-mode-indent-offset 4))

(with-eval-after-load 'c++-ts-mode
  (setq c++-ts-mode-indent-offset 4))

(add-hook 'c-ts-mode-hook
          (lambda ()
            (setq-local c-ts-mode-indent-offset 4)
            (setq-local tab-width 4)
            (setq-local indent-tabs-mode nil)))

(add-hook 'c++-ts-mode-hook
          (lambda ()
            (setq-local c++-ts-mode-indent-offset 4)
            (setq-local tab-width 4)
            (setq-local indent-tabs-mode nil)))

(add-hook 'hack-local-variables-hook
          (lambda ()
            (when (derived-mode-p 'c-mode 'c++-mode)
              (setq-local c-basic-offset 4
                          tab-width 4
                          indent-tabs-mode nil))))
#+end_src

* BACKUP 
By default, Emacs creates automatic backups of files in their original directories, such "file.el" and the backup "file.el~".  This leads to a lot of clutter, so let's tell Emacs to put all backups that it creates in the =TRASH= directory.

#+begin_src emacs-lisp
(setq backup-directory-alist '((".*" . "~/.local/share/Trash/files")))

#+end_src

* COMPANY
[[https://company-mode.github.io/][Company]] is a text completion framework for Emacs. The name stands for "complete anything".  Completion will start automatically after you type a few letters. Use M-n and M-p to select, <return> to complete or <tab> to complete the common part.

#+begin_src emacs-lisp
(use-package company
  :defer 2
  :diminish
  :custom
  (company-begin-commands '(self-insert-command))
  (company-idle-delay nil) ;; is disabled. change nil to .1 to enable
  (company-minimum-prefix-length 2)
  (company-show-numbers t)
  (company-tooltip-align-annotations 't)
  (global-company-mode t))

(use-package company-box
  :after company
  :diminish
  :hook (company-mode . company-box-mode))
#+end_src

