config/emacs/config.el

(use-package rainbow-mode
  :diminish
  :hook ((org-mode . rainbow-mode)
         (prog-mode . rainbow-mode)
         (css-mode . rainbow-mode)
         (html-mode . rainbow-mode)
         (conf-mode . rainbow-mode)))

(delete-selection-mode 1)    ;; You can select text and delete it by typing.
(electric-indent-mode 1)    ;; Turn off the weird indenting that Emacs does by default.
(electric-pair-mode -1)       ;; Turns on automatic parens pairing
;; The following prevents <> from auto-pairing when electric-pair-mode is on.
;; Otherwise, org-tempo is broken when you try to <s TAB...
(add-hook 'org-mode-hook (lambda ()
           (setq-local electric-pair-inhibit-predicate
                   `(lambda (c)
                  (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
(global-auto-revert-mode t)  ;; Automatically show changes if the file has changed
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode 1) ;; Display line numbers
(global-visual-line-mode t)  ;; Enable truncated lines
(menu-bar-mode -1)           ;; Disable the menu bar 
(scroll-bar-mode -1)         ;; Disable the scroll bar
(tool-bar-mode -1)           ;; Disable the tool bar
(setq org-edit-src-content-indentation 0) ;; Set src block automatic indent to 0 instead of 2.
(setq-default tab-width 4)
(setq-default indent-tabs-mode nil)

(use-package eshell-toggle
  :custom
  (eshell-toggle-size-fraction 3)
  (eshell-toggle-use-projectile-root t)
  (eshell-toggle-run-command nil)
  (eshell-toggle-init-function #'eshell-toggle-init-ansi-term))

  (use-package eshell-syntax-highlighting
    :after esh-mode
    :config
    (eshell-syntax-highlighting-global-mode +1))

  ;; eshell-syntax-highlighting -- adds fish/zsh-like syntax highlighting.
  ;; eshell-rc-script -- your profile for eshell; like a bashrc for eshell.
  ;; eshell-aliases-file -- sets an aliases file for the eshell.

  (setq eshell-rc-script (concat user-emacs-directory "eshell/profile")
        eshell-aliases-file (concat user-emacs-directory "eshell/aliases")
        eshell-history-size 5000
        eshell-buffer-maximum-lines 5000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t
        eshell-destroy-buffer-when-process-dies t
        eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))

(use-package vterm
  :commands vterm
  :config
  ;; Match your normal terminal
  (setq vterm-shell "/bin/zsh"
        vterm-shell-args '("-l")     ;; login shell → same zsh config as your terminal
        vterm-max-scrollback 5000)

  ;; If your vterm build supports it, tell vterm to let Emacs handle these keys.
  (when (boundp 'vterm-keymap-exceptions)
    (dolist (k '("C-y" "M-W"))
      (add-to-list 'vterm-keymap-exceptions k)))

  ;; Bind keys in vterm buffers
  (add-hook 'vterm-mode-hook
            (lambda ()
              ;; Paste
              (define-key vterm-mode-map (kbd "C-y") #'vterm-yank)

              ;; Copy (region must be active)
              (define-key vterm-mode-map (kbd "M-W") #'kill-ring-save)

              ;; Keep bindings consistent under Evil
              (when (bound-and-true-p evil-mode)
                (evil-define-key '(normal insert visual) vterm-mode-map
                  (kbd "C-y") #'vterm-yank
                  (kbd "M-W") #'kill-ring-save)))))

(use-package vterm-toggle
  :after vterm
  :config
  ;; In vterm, make ESC send ESC to the terminal even under Evil.
  (with-eval-after-load 'vterm
    (when (fboundp 'vterm-send-escape)
      (evil-define-key '(normal insert) vterm-mode-map
        (kbd "<escape>") #'vterm-send-escape)))

  (setq vterm-toggle-fullscreen-p nil
        vterm-toggle-scope 'project))

(use-package sudo-edit)

(add-to-list 'custom-theme-load-path (dt/in-emacs-dir "themes/"))

(use-package doom-themes
  :config
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  ;; Sets the default theme to load!!! 
  (load-theme 'doom-one t)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(use-package tldr)

(add-to-list 'default-frame-alist '(alpha-background . 100)) ; For all new frames henceforth

;; -------------------------
