config/emacs/config.el
;; OCaml (Tuareg + Merlin + ocp-indent + ocamlformat)
;; Fish + Arch + opam safe setup
;; -------------------------

;; --------------------------------------------------
;; Ensure opam binaries are on Emacs PATH
;; --------------------------------------------------
(let* ((opam-bin (expand-file-name "~/.opam/default/bin")))
  (when (file-directory-p opam-bin)
    (add-to-list 'exec-path opam-bin)
    (setenv "PATH" (concat opam-bin path-separator (getenv "PATH")))))

;; --------------------------------------------------
;; Tuareg mode
;; --------------------------------------------------
(use-package tuareg
  :mode (("\\.ml\\'"  . tuareg-mode)
         ("\\.mli\\'" . tuareg-mode)
         ("\\.mll\\'" . tuareg-mode)
         ("\\.mly\\'" . tuareg-mode)))

;; --------------------------------------------------
;; ocp-indent (indentation engine)
;; Falls back to tuareg indentation if not found
;; --------------------------------------------------
(use-package ocp-indent
  :after tuareg
  :hook (tuareg-mode . (lambda ()
                         (setq-local indent-tabs-mode nil)
                         (if (executable-find "ocp-indent")
                             (setq-local indent-line-function #'ocp-indent-line)
                           (setq-local indent-line-function #'tuareg-indent-command)
                           (message "ocp-indent not found; using tuareg indentation")))))

;; --------------------------------------------------
;; Merlin (IDE features)
;; --------------------------------------------------
(use-package merlin
  :after tuareg
  :hook (tuareg-mode . merlin-mode)
  :custom
  (merlin-command "ocamlmerlin")
  (merlin-completion-with-doc t)
  :config
  (unless (executable-find "ocamlmerlin")
    (message "merlin: ocamlmerlin not found on PATH (fish: opam env --shell=fish | source)")))

;; --------------------------------------------------
;; ocamlformat (format on save, optional)
;; --------------------------------------------------
(use-package ocamlformat
  :after tuareg
  :hook (tuareg-mode . (lambda ()
                         (when (executable-find "ocamlformat")
                           (add-hook 'before-save-hook
                                     #'ocamlformat-before-save
                                     nil t))))
  :config
  (unless (executable-find "ocamlformat")
    (message "ocamlformat: binary not found on PATH (install via opam)")))

;; --------------------------------------------------
;; Fix TAB indentation (you globally unbound TAB in evil)
;; --------------------------------------------------
(with-eval-after-load 'tuareg
  (define-key tuareg-mode-map (kbd "TAB") #'indent-for-tab-command)
  (define-key tuareg-mode-map (kbd "<tab>") #'indent-for-tab-command)

  (with-eval-after-load 'evil
    (evil-define-key '(normal insert)
      tuareg-mode-map
      (kbd "TAB") #'indent-for-tab-command
      (kbd "<tab>") #'indent-for-tab-command)))

(use-package which-key
  :init
    (which-key-mode 1)
  :diminish
  :config
  (setq which-key-side-window-location 'bottom
	  which-key-sort-order #'which-key-key-order-alpha
	  which-key-allow-imprecise-window-fit nil
	  which-key-sort-uppercase-first nil
	  which-key-add-column-padding 1
	  which-key-max-display-columns nil
	  which-key-min-display-lines 6
	  which-key-side-window-slot -10
	  which-key-side-window-max-height 0.25
	  which-key-idle-delay 0.8
	  which-key-max-description-length 25
	  which-key-allow-imprecise-window-fit nil
	  which-key-separator " → " ))
